LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
/**
 *
 * @file SYSCTL_RegisterPeripheral_Bitbanding.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 23 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 23 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERPERIPHERAL_BITBANDING_H_
#define XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERPERIPHERAL_BITBANDING_H_

#include <xDriver_MCU/SYSCTL/Peripheral/Register/RegisterDefines/SYSCTL_RegisterDefines.h>
#include <xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterAddress.h>
#include <xDriver_MCU/SYSCTL/Peripheral/Struct/xHeader/SYSCTL_StructPeripheral_Bitbanding.h>

#define SYSCTL_BITBANDING    ((SYSCTL_BITBANDING_t*) (SYSCTL_BITBANDING_BASE + SYSCTL_OFFSET * 32UL))

/*******************************************************************************************
************************************ 1 DID0 *********************************************
*******************************************************************************************/
#define DEVICE_BITBANDING_ID0    ((DEVICE_BITBANDING_ID0_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DEVICE_ID0_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 2 DID1 *********************************************
******************************************************************************************/
#define DEVICE_BITBANDING_ID1    ((DEVICE_BITBANDING_ID1_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DEVICE_ID1_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 3 PTBOCTL *********************************************
******************************************************************************************/
#define PTBO_BITBANDING_CTL    ((PTBO_BITBANDING_CTL_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PTBO_CTL_OFFSET) * 32UL)))

#define PTBO_BITBANDING_CTL_VDDA_UBOR_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PTBO_CTL_OFFSET) * 32UL) + ((PTBO_CTL_R_VDDA_UBOR_BIT + 0UL) * 4UL))))
#define PTBO_BITBANDING_CTL_VDDA_UBOR_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PTBO_CTL_OFFSET) * 32UL) + ((PTBO_CTL_R_VDDA_UBOR_BIT + 1UL) * 4UL))))
#define PTBO_BITBANDING_CTL_VDD_UBOR_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PTBO_CTL_OFFSET) * 32UL) + ((PTBO_CTL_R_VDD_UBOR_BIT + 0UL) * 4UL))))
#define PTBO_BITBANDING_CTL_VDD_UBOR_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PTBO_CTL_OFFSET) * 32UL) + ((PTBO_CTL_R_VDD_UBOR_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************ 4 RIS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RIS    ((SYSCTL_BITBANDING_RIS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RIS_BOR    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_BOR_BIT * 4UL))))
#define SYSCTL_BITBANDING_RIS_MOSC_FAILURE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_MOSC_FAILURE_BIT * 4UL))))
#define SYSCTL_BITBANDING_RIS_PLL_LOCK    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_PLL_LOCK_BIT * 4UL))))
#define SYSCTL_BITBANDING_RIS_MOSC_POWERUP    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RIS_OFFSET) * 32UL) + (SYSCTL_RIS_R_MOSC_POWERUP_BIT * 4UL))))

/******************************************************************************************
************************************ 5 IMC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_IMC    ((SYSCTL_BITBANDING_IMC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_IMC_BOR    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_BOR_BIT * 4UL))))
#define SYSCTL_BITBANDING_IMC_MOSC_FAILURE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_MOSC_FAILURE_BIT * 4UL))))
#define SYSCTL_BITBANDING_IMC_PLL_LOCK    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_PLL_LOCK_BIT * 4UL))))
#define SYSCTL_BITBANDING_IMC_MOSC_POWERUP    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_IMC_OFFSET) * 32UL) + (SYSCTL_IMC_R_MOSC_POWERUP_BIT * 4UL))))

/******************************************************************************************
************************************ 6 MISC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_MISC    ((SYSCTL_BITBANDING_MISC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_MISC_BOR    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_BOR_BIT * 4UL))))
#define SYSCTL_BITBANDING_MISC_MOSC_FAILURE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_MOSC_FAILURE_BIT * 4UL))))
#define SYSCTL_BITBANDING_MISC_PLL_LOCK    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_PLL_LOCK_BIT * 4UL))))
#define SYSCTL_BITBANDING_MISC_MOSC_POWERUP    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_MISC_OFFSET) * 32UL) + (SYSCTL_MISC_R_MOSC_POWERUP_BIT * 4UL))))

/******************************************************************************************
************************************ 7 RESC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RESC    ((SYSCTL_BITBANDING_RESC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL)))

