LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_RESC_EXTERNAL    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_EXTERNAL_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_POR    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_POR_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_BOR    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_BOR_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_WDT0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_SW    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_SW_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_WDT1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_WDT1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_HSSR    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_HSSR_BIT * 4UL))))
#define SYSCTL_BITBANDING_RESC_MOSC_FAILURE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RESC_OFFSET) * 32UL) + (SYSCTL_RESC_R_MOSC_FAILURE_BIT * 4UL))))

/******************************************************************************************
************************************ 8 PWRTC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PWRTC    ((SYSCTL_BITBANDING_PWRTC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PWRTC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PWRTC_VDD_UBOR    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PWRTC_OFFSET) * 32UL) + (SYSCTL_PWRTC_R_VDD_UBOR_BIT * 4UL))))
#define SYSCTL_BITBANDING_PWRTC_VDDA_UBOR    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PWRTC_OFFSET) * 32UL) + (SYSCTL_PWRTC_R_VDDA_UBOR_BIT * 4UL))))

/******************************************************************************************
************************************ 9 NMIC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_NMIC    ((SYSCTL_BITBANDING_NMIC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_NMIC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_NMIC_EXTERNAL    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_NMIC_OFFSET) * 32UL) + (SYSCTL_NMIC_R_EXTERNAL_BIT * 4UL))))
#define SYSCTL_BITBANDING_NMIC_POWER    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_NMIC_OFFSET) * 32UL) + (SYSCTL_NMIC_R_POWER_BIT * 4UL))))
#define SYSCTL_BITBANDING_NMIC_WDT0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_NMIC_OFFSET) * 32UL) + (SYSCTL_NMIC_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_NMIC_WDT1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_NMIC_OFFSET) * 32UL) + (SYSCTL_NMIC_R_WDT1_BIT * 4UL))))
#define SYSCTL_BITBANDING_NMIC_TAMPER    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_NMIC_OFFSET) * 32UL) + (SYSCTL_NMIC_R_TAMPER_BIT * 4UL))))
#define SYSCTL_BITBANDING_NMIC_MOSC_FAILURE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_NMIC_OFFSET) * 32UL) + (SYSCTL_NMIC_R_MOSC_FAILURE_BIT * 4UL))))

/******************************************************************************************
************************************ 10 MOSCCTL *********************************************
******************************************************************************************/
#define MOSC_BITBANDING_CTL    ((MOSC_BITBANDING_CTL_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MOSC_CTL_OFFSET) * 32UL)))

#define MOSC_BITBANDING_CTL_CVAL    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MOSC_CTL_OFFSET) * 32UL) + (MOSC_CTL_R_CVAL_BIT * 4UL))))
#define MOSC_BITBANDING_CTL_MOSCIM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MOSC_CTL_OFFSET) * 32UL) + (MOSC_CTL_R_MOSCIM_BIT * 4UL))))
#define MOSC_BITBANDING_CTL_NOXTAL    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MOSC_CTL_OFFSET) * 32UL) + (MOSC_CTL_R_NOXTAL_BIT * 4UL))))
#define MOSC_BITBANDING_CTL_PWRDN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MOSC_CTL_OFFSET) * 32UL) + (MOSC_CTL_R_PWRDN_BIT * 4UL))))
#define MOSC_BITBANDING_CTL_OSCRNG    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MOSC_CTL_OFFSET) * 32UL) + (MOSC_CTL_R_OSCRNG_BIT * 4UL))))

/******************************************************************************************
************************************11 RSCLKCFG *********************************************
******************************************************************************************/
#define RSCLK_BITBANDING_CFG    ((RSCLK_BITBANDING_CFG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL)))

#define RSCLK_BITBANDING_CFG_OSC_SRC_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + ((RSCLK_CFG_R_OSC_SRC_BIT + 0UL) * 4UL))))
#define RSCLK_BITBANDING_CFG_OSC_SRC_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + ((RSCLK_CFG_R_OSC_SRC_BIT + 1UL) * 4UL))))
#define RSCLK_BITBANDING_CFG_OSC_SRC_2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + ((RSCLK_CFG_R_OSC_SRC_BIT + 2UL) * 4UL))))
#define RSCLK_BITBANDING_CFG_OSC_SRC_3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + ((RSCLK_CFG_R_OSC_SRC_BIT + 3UL) * 4UL))))
#define RSCLK_BITBANDING_CFG_PLL_SRC_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + ((RSCLK_CFG_R_PLL_SRC_BIT + 0UL) * 4UL))))
#define RSCLK_BITBANDING_CFG_PLL_SRC_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + ((RSCLK_CFG_R_PLL_SRC_BIT + 1UL) * 4UL))))
#define RSCLK_BITBANDING_CFG_PLL_SRC_2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + ((RSCLK_CFG_R_PLL_SRC_BIT + 2UL) * 4UL))))
#define RSCLK_BITBANDING_CFG_PLL_SRC_3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + ((RSCLK_CFG_R_PLL_SRC_BIT + 3UL) * 4UL))))
#define RSCLK_BITBANDING_CFG_USEPLL    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + (RSCLK_CFG_R_USEPLL_BIT * 4UL))))
#define RSCLK_BITBANDING_CFG_ACG    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + (RSCLK_CFG_R_ACG_BIT * 4UL))))
#define RSCLK_BITBANDING_CFG_NEW_PLLFREQ    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + (RSCLK_CFG_R_NEW_PLLFREQ_BIT * 4UL))))
#define RSCLK_BITBANDING_CFG_MEMTIMU    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RSCLK_CFG_OFFSET) * 32UL) + (RSCLK_CFG_R_MEMTIMU_BIT * 4UL))))

/******************************************************************************************
************************************12 MEMTIM0 *********************************************
******************************************************************************************/
#define MEMORY_BITBANDING_TIM0    ((MEMORY_BITBANDING_TIM0_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL)))

#define MEMORY_BITBANDING_TIM0_FLASH_WS_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_FLASH_WS_BIT + 0UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_FLASH_WS_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_FLASH_WS_BIT + 1UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_FLASH_WS_2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_FLASH_WS_BIT + 2UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_FLASH_WS_3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_FLASH_WS_BIT + 3UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_FLASH_BCE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + (MEMORY_TIM0_R_FLASH_BCE_BIT * 4UL))))
#define MEMORY_BITBANDING_TIM0_FLASH_BCHT_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_FLASH_BCHT_BIT + 0UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_FLASH_BCHT_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_FLASH_BCHT_BIT + 1UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_FLASH_BCHT_2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_FLASH_BCHT_BIT + 2UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_FLASH_BCHT_3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_FLASH_BCHT_BIT + 3UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_EEPROM_WS_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_EEPROM_WS_BIT + 0UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_EEPROM_WS_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_EEPROM_WS_BIT + 1UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_EEPROM_WS_2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_EEPROM_WS_BIT + 2UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_EEPROM_WS_3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_EEPROM_WS_BIT + 3UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_EEPROM_BCE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + (MEMORY_TIM0_R_EEPROM_BCE_BIT * 4UL))))
#define MEMORY_BITBANDING_TIM0_EEPROM_BCHT_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_EEPROM_BCHT_BIT + 0UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_EEPROM_BCHT_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_EEPROM_BCHT_BIT + 1UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_EEPROM_BCHT_2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_EEPROM_BCHT_BIT + 2UL) * 4UL))))
#define MEMORY_BITBANDING_TIM0_EEPROM_BCHT_3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + MEMORY_TIM0_OFFSET) * 32UL) + ((MEMORY_TIM0_R_EEPROM_BCHT_BIT + 3UL) * 4UL))))

/******************************************************************************************
************************************13 ALTCLKCFG *********************************************
******************************************************************************************/
#define ALTCLK_BITBANDING_CFG    ((ALTCLK_BITBANDING_CFG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + ALTCLK_CFG_OFFSET) * 32UL)))

