LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define ALTCLK_BITBANDING_CFG_ALTCLK_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + ALTCLK_CFG_OFFSET) * 32UL) + ((ALTCLK_CFG_R_ALTCLK_BIT + 0UL) * 4UL))))
#define ALTCLK_BITBANDING_CFG_ALTCLK_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + ALTCLK_CFG_OFFSET) * 32UL) + ((ALTCLK_CFG_R_ALTCLK_BIT + 1UL) * 4UL))))
#define ALTCLK_BITBANDING_CFG_ALTCLK_2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + ALTCLK_CFG_OFFSET) * 32UL) + ((ALTCLK_CFG_R_ALTCLK_BIT + 2UL) * 4UL))))
#define ALTCLK_BITBANDING_CFG_ALTCLK_3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + ALTCLK_CFG_OFFSET) * 32UL) + ((ALTCLK_CFG_R_ALTCLK_BIT + 3UL) * 4UL))))

/******************************************************************************************
************************************14 DSCLKCFG *********************************************
******************************************************************************************/
#define DSCLK_BITBANDING_CFG    ((DSCLK_BITBANDING_CFG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSCLK_CFG_OFFSET) * 32UL)))

#define DSCLK_BITBANDING_CFG_DEEPSLEEP_OSC_SRC_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSCLK_CFG_OFFSET) * 32UL) + ((DSCLK_CFG_R_DEEPSLEEP_OSC_SRC_BIT + 0UL) * 4UL))))
#define DSCLK_BITBANDING_CFG_DEEPSLEEP_OSC_SRC_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSCLK_CFG_OFFSET) * 32UL) + ((DSCLK_CFG_R_DEEPSLEEP_OSC_SRC_BIT + 1UL) * 4UL))))
#define DSCLK_BITBANDING_CFG_DEEPSLEEP_OSC_SRC_2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSCLK_CFG_OFFSET) * 32UL) + ((DSCLK_CFG_R_DEEPSLEEP_OSC_SRC_BIT + 2UL) * 4UL))))
#define DSCLK_BITBANDING_CFG_DEEPSLEEP_OSC_SRC_3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSCLK_CFG_OFFSET) * 32UL) + ((DSCLK_CFG_R_DEEPSLEEP_OSC_SRC_BIT + 3UL) * 4UL))))
#define DSCLK_BITBANDING_CFG_MOSC_DPD    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSCLK_CFG_OFFSET) * 32UL) + (DSCLK_CFG_R_MOSC_DPD_BIT * 4UL))))
#define DSCLK_BITBANDING_CFG_PIOSC_PD    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSCLK_CFG_OFFSET) * 32UL) + (DSCLK_CFG_R_PIOSC_PD_BIT * 4UL))))

/******************************************************************************************
************************************15 DIVSCLK *********************************************
******************************************************************************************/
#define DIVSCLK_BITBANDING_CFG    ((DIVSCLK_BITBANDING_CFG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DIVSCLK_CFG_OFFSET) * 32UL)))

#define DIVSCLK_BITBANDING_CFG_SRC_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DIVSCLK_CFG_OFFSET) * 32UL) + ((DIVSCLK_CFG_R_SRC_BIT + 0UL) * 4UL))))
#define DIVSCLK_BITBANDING_CFG_SRC_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DIVSCLK_CFG_OFFSET) * 32UL) + ((DIVSCLK_CFG_R_SRC_BIT + 1UL) * 4UL))))
#define DIVSCLK_BITBANDING_CFG_EN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DIVSCLK_CFG_OFFSET) * 32UL) + (DIVSCLK_CFG_R_EN_BIT * 4UL))))

/******************************************************************************************
************************************16 SYSPROP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PROP    ((SYSCTL_BITBANDING_PROP_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PROP_FPU    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROP_OFFSET) * 32UL) + (SYSCTL_PROP_R_FPU_BIT * 4UL))))
#define SYSCTL_BITBANDING_PROP_LDO_SEQ    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROP_OFFSET) * 32UL) + (SYSCTL_PROP_R_LDO_SEQ_BIT * 4UL))))
#define SYSCTL_BITBANDING_PROP_FLASH_LPM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROP_OFFSET) * 32UL) + (SYSCTL_PROP_R_FLASH_LPM_BIT * 4UL))))
#define SYSCTL_BITBANDING_PROP_SRAM_LPM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROP_OFFSET) * 32UL) + (SYSCTL_PROP_R_SRAM_LPM_BIT * 4UL))))
#define SYSCTL_BITBANDING_PROP_SRAM_SM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROP_OFFSET) * 32UL) + (SYSCTL_PROP_R_SRAM_SM_BIT * 4UL))))
#define SYSCTL_BITBANDING_PROP_PIOSC_PDE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROP_OFFSET) * 32UL) + (SYSCTL_PROP_R_PIOSC_PDE_BIT * 4UL))))
#define SYSCTL_BITBANDING_PROP_TS_PDE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROP_OFFSET) * 32UL) + (SYSCTL_PROP_R_TS_PDE_BIT * 4UL))))
#define SYSCTL_BITBANDING_PROP_LDO_SME    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROP_OFFSET) * 32UL) + (SYSCTL_PROP_R_LDO_SME_BIT * 4UL))))

/******************************************************************************************
************************************17 PIOSCCAL *********************************************
******************************************************************************************/
#define PIOSC_BITBANDING_CAL    ((PIOSC_BITBANDING_CAL_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PIOSC_CAL_OFFSET) * 32UL)))

#define PIOSC_BITBANDING_CAL_UPDATE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PIOSC_CAL_OFFSET) * 32UL) + (PIOSC_CAL_R_UPDATE_BIT * 4UL))))
#define PIOSC_BITBANDING_CAL_CAL    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PIOSC_CAL_OFFSET) * 32UL) + (PIOSC_CAL_R_CAL_BIT * 4UL))))
#define PIOSC_BITBANDING_CAL_UTEN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PIOSC_CAL_OFFSET) * 32UL) + (PIOSC_CAL_R_UTEN_BIT * 4UL))))

/******************************************************************************************
************************************18 PIOSCSTAT *********************************************
******************************************************************************************/
#define PIOSC_BITBANDING_STAT    ((PIOSC_BITBANDING_STAT_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PIOSC_STAT_OFFSET) * 32UL)))

#define PIOSC_BITBANDING_STAT_RESULT_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PIOSC_STAT_OFFSET) * 32UL) + ((PIOSC_STAT_R_RESULT_BIT + 0UL) * 4UL))))
#define PIOSC_BITBANDING_STAT_RESULT_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PIOSC_STAT_OFFSET) * 32UL) + ((PIOSC_STAT_R_RESULT_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************19 PLLFREQ0 *********************************************
******************************************************************************************/
#define PLL_BITBANDING_FREQ0    ((PLL_BITBANDING_FREQ0_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PLL_FREQ0_OFFSET) * 32UL)))

