LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define PLL_BITBANDING_FREQ0_PLL_PWR    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PLL_FREQ0_OFFSET) * 32UL) + (PLL_FREQ0_R_PLL_PWR_BIT * 4UL))))

/******************************************************************************************
************************************20 PLLFREQ1 *********************************************
******************************************************************************************/
#define PLL_BITBANDING_FREQ1    ((PLL_BITBANDING_FREQ1_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PLL_FREQ1_OFFSET) * 32UL)))

/******************************************************************************************
************************************21 PLLSTAT *********************************************
******************************************************************************************/
#define PLL_BITBANDING_STAT    ((PLL_BITBANDING_STAT_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PLL_STAT_OFFSET) * 32UL)))

#define PLL_BITBANDING_STAT_LOCK    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + PLL_STAT_OFFSET) * 32UL) + (PLL_STAT_R_LOCK_BIT * 4UL))))

/******************************************************************************************
************************************22 SLPPWRCFG *********************************************
******************************************************************************************/
#define SLPPWR_BITBANDING_CFG    ((SLPPWR_BITBANDING_CFG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SLPPWR_CFG_OFFSET) * 32UL)))

#define SLPPWR_BITBANDING_CFG_SRAM_PM_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SLPPWR_CFG_OFFSET) * 32UL) + ((SLPPWR_CFG_R_SRAM_PM_BIT + 0UL) * 4UL))))
#define SLPPWR_BITBANDING_CFG_SRAM_PM_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SLPPWR_CFG_OFFSET) * 32UL) + ((SLPPWR_CFG_R_SRAM_PM_BIT + 1UL) * 4UL))))
#define SLPPWR_BITBANDING_CFG_FLASH_PM_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SLPPWR_CFG_OFFSET) * 32UL) + ((SLPPWR_CFG_R_FLASH_PM_BIT + 0UL) * 4UL))))
#define SLPPWR_BITBANDING_CFG_FLASH_PM_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SLPPWR_CFG_OFFSET) * 32UL) + ((SLPPWR_CFG_R_FLASH_PM_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************23 DSLPPWRCFG *********************************************
******************************************************************************************/
#define DSLPPWR_BITBANDING_CFG    ((DSLPPWR_BITBANDING_CFG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSLPPWR_CFG_OFFSET) * 32UL)))

#define DSLPPWR_BITBANDING_CFG_SRAM_PM_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSLPPWR_CFG_OFFSET) * 32UL) + ((DSLPPWR_CFG_R_SRAM_PM_BIT + 0UL) * 4UL))))
#define DSLPPWR_BITBANDING_CFG_SRAM_PM_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSLPPWR_CFG_OFFSET) * 32UL) + ((DSLPPWR_CFG_R_SRAM_PM_BIT + 1UL) * 4UL))))
#define DSLPPWR_BITBANDING_CFG_FLASH_PM_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSLPPWR_CFG_OFFSET) * 32UL) + ((DSLPPWR_CFG_R_FLASH_PM_BIT + 0UL) * 4UL))))
#define DSLPPWR_BITBANDING_CFG_FLASH_PM_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSLPPWR_CFG_OFFSET) * 32UL) + ((DSLPPWR_CFG_R_FLASH_PM_BIT + 1UL) * 4UL))))
#define DSLPPWR_BITBANDING_CFG_TS_PD    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSLPPWR_CFG_OFFSET) * 32UL) + (DSLPPWR_CFG_R_TS_PD_BIT * 4UL))))
#define DSLPPWR_BITBANDING_CFG_LDO_SM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + DSLPPWR_CFG_OFFSET) * 32UL) + (DSLPPWR_CFG_R_LDO_SM_BIT * 4UL))))

/**********************************************************************************
************************************24 NVMSTAT *********************************************
******************************************************************************************/
#define NVM_BITBANDING_STAT    ((NVM_BITBANDING_STAT_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + NVM_STAT_OFFSET) * 32UL)))

#define NVM_BITBANDING_STAT_FWB    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + NVM_STAT_OFFSET) * 32UL) + (NVM_STAT_R_FWB_BIT * 4UL))))

/******************************************************************************************
************************************25 LDOSPCTL *********************************************
******************************************************************************************/
#define LDO_BITBANDING_SPCTL    ((LDO_BITBANDING_SPCTL_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + LDO_SPCTL_OFFSET) * 32UL)))

#define LDO_BITBANDING_SPCTL_VADJEN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + LDO_SPCTL_OFFSET) * 32UL) + (LDO_SPCTL_R_VADJEN_BIT * 4UL))))

/******************************************************************************************
************************************26 LDOSPCAL *********************************************
******************************************************************************************/
#define LDO_BITBANDING_SPCAL    ((LDO_BITBANDING_SPCAL_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + LDO_SPCAL_OFFSET) * 32UL)))

/******************************************************************************************
************************************27 LDODPCTL *********************************************
******************************************************************************************/
#define LDO_BITBANDING_DPCTL    ((LDO_BITBANDING_DPCTL_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + LDO_DPCTL_OFFSET) * 32UL)))

#define LDO_BITBANDING_DPCTL_VADJEN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + LDO_DPCTL_OFFSET) * 32UL) + (LDO_DPCTL_R_VADJEN_BIT * 4UL))))

/******************************************************************************************
************************************28 LDODPCAL *********************************************
******************************************************************************************/
#define LDO_BITBANDING_DPCAL    ((LDO_BITBANDING_DPCAL_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + LDO_DPCAL_OFFSET) * 32UL)))

/******************************************************************************************
************************************29 SDPMST *********************************************
******************************************************************************************/
#define SDP_BITBANDING_MST    ((SDP_BITBANDING_MST_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL)))

#define SDP_BITBANDING_MST_SRAM_PD_ERR    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_SRAM_PD_ERR_BIT * 4UL))))
#define SDP_BITBANDING_MST_FLASH_PD_ERR    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_FLASH_PD_ERR_BIT * 4UL))))
#define SDP_BITBANDING_MST_PIOSC_PD_ERR    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_PIOSC_PD_ERR_BIT * 4UL))))
#define SDP_BITBANDING_MST_VLDO_DMIN_ERR    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_VLDO_DMIN_ERR_BIT * 4UL))))
#define SDP_BITBANDING_MST_VLDO_SMIN_ERR    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_VLDO_SMIN_ERR_BIT * 4UL))))
#define SDP_BITBANDING_MST_VLDO_MAX_ERR    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_VLDO_MAX_ERR_BIT * 4UL))))
#define SDP_BITBANDING_MST_PIOSC_PD_WARNING    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_PIOSC_PD_WARNING_BIT * 4UL))))
#define SDP_BITBANDING_MST_LOW_ACTIVE    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_LOW_ACTIVE_BIT * 4UL))))
#define SDP_BITBANDING_MST_LOW_PWR    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_LOW_PWR_BIT * 4UL))))
#define SDP_BITBANDING_MST_FLASH_LP    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_FLASH_LP_BIT * 4UL))))
#define SDP_BITBANDING_MST_LDO_UA    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SDP_MST_OFFSET) * 32UL) + (SDP_MST_R_LDO_UA_BIT * 4UL))))

/******************************************************************************************
************************************30 RESBEHAVCTL *********************************************
******************************************************************************************/
#define RESET_BITBANDING_BEHAVCTL    ((RESET_BITBANDING_BEHAVCTL_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RESET_BEHAVCTL_OFFSET) * 32UL)))

#define RESET_BITBANDING_BEHAVCTL_EXTERNAL_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RESET_BEHAVCTL_OFFSET) * 32UL) + ((RESET_BEHAVCTL_R_EXTERNAL_BIT + 0UL) * 4UL))))
#define RESET_BITBANDING_BEHAVCTL_EXTERNAL_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RESET_BEHAVCTL_OFFSET) * 32UL) + ((RESET_BEHAVCTL_R_EXTERNAL_BIT + 1UL) * 4UL))))
#define RESET_BITBANDING_BEHAVCTL_BOR_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RESET_BEHAVCTL_OFFSET) * 32UL) + ((RESET_BEHAVCTL_R_BOR_BIT + 0UL) * 4UL))))
#define RESET_BITBANDING_BEHAVCTL_BOR_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RESET_BEHAVCTL_OFFSET) * 32UL) + ((RESET_BEHAVCTL_R_BOR_BIT + 1UL) * 4UL))))
#define RESET_BITBANDING_BEHAVCTL_WDG0_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RESET_BEHAVCTL_OFFSET) * 32UL) + ((RESET_BEHAVCTL_R_WDG0_BIT + 0UL) * 4UL))))
#define RESET_BITBANDING_BEHAVCTL_WDG0_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RESET_BEHAVCTL_OFFSET) * 32UL) + ((RESET_BEHAVCTL_R_WDG0_BIT + 1UL) * 4UL))))
#define RESET_BITBANDING_BEHAVCTL_WDG1_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RESET_BEHAVCTL_OFFSET) * 32UL) + ((RESET_BEHAVCTL_R_WDG1_BIT + 0UL) * 4UL))))
#define RESET_BITBANDING_BEHAVCTL_WDG1_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + RESET_BEHAVCTL_OFFSET) * 32UL) + ((RESET_BEHAVCTL_R_WDG1_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************31 HSSR *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_HSSR    ((SYSCTL_BITBANDING_HSSR_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_HSSR_OFFSET) * 32UL)))

/******************************************************************************************
************************************32 USBPDS *********************************************
******************************************************************************************/
#define USB_BITBANDING_PDS    ((USB_BITBANDING_PDS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USB_PDS_OFFSET) * 32UL)))

#define USB_BITBANDING_PDS_PWRSTAT_0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USB_PDS_OFFSET) * 32UL) + ((USB_PDS_R_PWRSTAT_BIT + 0UL) * 4UL))))
#define USB_BITBANDING_PDS_PWRSTAT_1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USB_PDS_OFFSET) * 32UL) + ((USB_PDS_R_PWRSTAT_BIT + 1UL) * 4UL))))
#define USB_BITBANDING_PDS_MEMSTAT_0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USB_PDS_OFFSET) * 32UL) + ((USB_PDS_R_MEMSTAT_BIT + 0UL) * 4UL))))
#define USB_BITBANDING_PDS_MEMSTAT_1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USB_PDS_OFFSET) * 32UL) + ((USB_PDS_R_MEMSTAT_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************33 USB_MPC *********************************************
******************************************************************************************/
#define USB_BITBANDING_MPC    ((USB_BITBANDING_MPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USB_MPC_OFFSET) * 32UL)))

#define USB_BITBANDING_MPC_PWRCTL_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USB_MPC_OFFSET) * 32UL) + ((USB_MPC_R_PWRCTL_BIT + 0UL) * 4UL))))
#define USB_BITBANDING_MPC_PWRCTL_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USB_MPC_OFFSET) * 32UL) + ((USB_MPC_R_PWRCTL_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************34 EMACPDS *********************************************
******************************************************************************************/
#define EMAC_BITBANDING_PDS    ((EMAC_BITBANDING_PDS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + EMAC_PDS_OFFSET) * 32UL)))

#define EMAC_BITBANDING_PDS_PWRSTAT_0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + EMAC_PDS_OFFSET) * 32UL) + ((EMAC_PDS_R_PWRSTAT_BIT + 0UL) * 4UL))))
#define EMAC_BITBANDING_PDS_PWRSTAT_1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + EMAC_PDS_OFFSET) * 32UL) + ((EMAC_PDS_R_PWRSTAT_BIT + 1UL) * 4UL))))
#define EMAC_BITBANDING_PDS_MEMSTAT_0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + EMAC_PDS_OFFSET) * 32UL) + ((EMAC_PDS_R_MEMSTAT_BIT + 0UL) * 4UL))))
#define EMAC_BITBANDING_PDS_MEMSTAT_1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + EMAC_PDS_OFFSET) * 32UL) + ((EMAC_PDS_R_MEMSTAT_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************35 EMACMPC *********************************************
******************************************************************************************/
#define EMAC_BITBANDING_MPC    ((EMAC_BITBANDING_MPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + EMAC_MPC_OFFSET) * 32UL)))

#define EMAC_BITBANDING_MPC_PWRCTL_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + EMAC_MPC_OFFSET) * 32UL) + ((EMAC_MPC_R_PWRCTL_BIT + 0UL) * 4UL))))
#define EMAC_BITBANDING_MPC_PWRCTL_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + EMAC_MPC_OFFSET) * 32UL) + ((EMAC_MPC_R_PWRCTL_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************36 CAN0PDS *********************************************
******************************************************************************************/
#define CAN0_BITBANDING_PDS    ((CAN0_BITBANDING_PDS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN0_PDS_OFFSET) * 32UL)))

#define CAN0_BITBANDING_PDS_PWRSTAT_0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN0_PDS_OFFSET) * 32UL) + ((CAN0_PDS_R_PWRSTAT_BIT + 0UL) * 4UL))))
#define CAN0_BITBANDING_PDS_PWRSTAT_1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN0_PDS_OFFSET) * 32UL) + ((CAN0_PDS_R_PWRSTAT_BIT + 1UL) * 4UL))))
#define CAN0_BITBANDING_PDS_MEMSTAT_0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN0_PDS_OFFSET) * 32UL) + ((CAN0_PDS_R_MEMSTAT_BIT + 0UL) * 4UL))))
#define CAN0_BITBANDING_PDS_MEMSTAT_1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN0_PDS_OFFSET) * 32UL) + ((CAN0_PDS_R_MEMSTAT_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************37 CAN0MPC *********************************************
******************************************************************************************/
#define CAN0_BITBANDING_MPC    ((CAN0_BITBANDING_MPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN0_MPC_OFFSET) * 32UL)))

#define CAN0_BITBANDING_MPC_PWRCTL_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN0_MPC_OFFSET) * 32UL) + ((CAN0_MPC_R_PWRCTL_BIT + 0UL) * 4UL))))
#define CAN0_BITBANDING_MPC_PWRCTL_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN0_MPC_OFFSET) * 32UL) + ((CAN0_MPC_R_PWRCTL_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************38 CAN1PDS *********************************************
******************************************************************************************/
#define CAN1_BITBANDING_PDS    ((CAN1_BITBANDING_PDS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN1_PDS_OFFSET) * 32UL)))

#define CAN1_BITBANDING_PDS_PWRSTAT_0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN1_PDS_OFFSET) * 32UL) + ((CAN1_PDS_R_PWRSTAT_BIT + 0UL) * 4UL))))
#define CAN1_BITBANDING_PDS_PWRSTAT_1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN1_PDS_OFFSET) * 32UL) + ((CAN1_PDS_R_PWRSTAT_BIT + 1UL) * 4UL))))
#define CAN1_BITBANDING_PDS_MEMSTAT_0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN1_PDS_OFFSET) * 32UL) + ((CAN1_PDS_R_MEMSTAT_BIT + 0UL) * 4UL))))
#define CAN1_BITBANDING_PDS_MEMSTAT_1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN1_PDS_OFFSET) * 32UL) + ((CAN1_PDS_R_MEMSTAT_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************39 CAN1MPC *********************************************
******************************************************************************************/
#define CAN1_BITBANDING_MPC    ((CAN1_BITBANDING_MPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN1_MPC_OFFSET) * 32UL)))

