LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define CAN1_BITBANDING_MPC_PWRCTL_0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN1_MPC_OFFSET) * 32UL) + ((CAN1_MPC_R_PWRCTL_BIT + 0UL) * 4UL))))
#define CAN1_BITBANDING_MPC_PWRCTL_1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + CAN1_MPC_OFFSET) * 32UL) + ((CAN1_MPC_R_PWRCTL_BIT + 1UL) * 4UL))))

/******************************************************************************************
************************************40 PPWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPWD    ((BITBANDING_PERIPHERAL_WD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPWD_WDT0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWD_OFFSET) * 32UL) + (SYSCTL_PPWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPWD_WDT1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWD_OFFSET) * 32UL) + (SYSCTL_PPWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************41 PPTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPTIMER    ((BITBANDING_PERIPHERAL_TIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPTIMER_TIMER0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER2    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER3    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER4    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER5    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER6    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPTIMER_TIMER7    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPTIMER_OFFSET) * 32UL) + (SYSCTL_PPTIMER_R_TIMER7_BIT * 4UL))))

/******************************************************************************************
************************************42 PPGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOA    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOB    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOC    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOD    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOE    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOF    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOG    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOH    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOJ    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOK    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOL    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOM    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPION    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOP    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPGPIO_BITBANDING_GPIOQ    (*((volatile const UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PPGPIO_OFFSET) * 32UL) + (SYSCTL_PPGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************43 PPDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPDMA    ((BITBANDING_PERIPHERAL_DMA_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPDMA_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPDMA_UDMA    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPDMA_OFFSET) * 32UL) + (SYSCTL_PPDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************44 PPEPI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPEPI    ((BITBANDING_PERIPHERAL_EPI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPEPI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPEPI_EPI0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPEPI_OFFSET) * 32UL) + (SYSCTL_PPEPI_R_EPI0_BIT * 4UL))))

/******************************************************************************************
************************************45 PPHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPHIB    ((BITBANDING_PERIPHERAL_HIB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPHIB_OFFSET) * 32UL)))

