LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PPHIB_HIB    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPHIB_OFFSET) * 32UL) + (SYSCTL_PPHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************46 PPUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPUART    ((BITBANDING_PERIPHERAL_UART_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPUART_UART0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART2    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART3    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART4    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART5    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART6    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPUART_UART7    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUART_OFFSET) * 32UL) + (SYSCTL_PPUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************47 PPSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPSSI    ((BITBANDING_PERIPHERAL_SSI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPSSI_SSI0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPSSI_OFFSET) * 32UL) + (SYSCTL_PPSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPSSI_SSI1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPSSI_OFFSET) * 32UL) + (SYSCTL_PPSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPSSI_SSI2    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPSSI_OFFSET) * 32UL) + (SYSCTL_PPSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPSSI_SSI3    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPSSI_OFFSET) * 32UL) + (SYSCTL_PPSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************48 PPI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPI2C    ((BITBANDING_PERIPHERAL_I2C_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPI2C_I2C0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C2    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C3    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C4    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C5    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C6    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C7    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C7_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C8    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C8_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPI2C_I2C9    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPI2C_OFFSET) * 32UL) + (SYSCTL_PPI2C_R_I2C9_BIT * 4UL))))

/******************************************************************************************
************************************49 PPUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPUSB    ((BITBANDING_PERIPHERAL_USB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPUSB_USB    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPUSB_OFFSET) * 32UL) + (SYSCTL_PPUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************50 PPEPHY *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPEPHY    ((BITBANDING_PERIPHERAL_EPHY_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPEPHY_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPEPHY_EPHY    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPEPHY_OFFSET) * 32UL) + (SYSCTL_PPEPHY_R_EPHY_BIT * 4UL))))

/******************************************************************************************
************************************51 PPCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPCAN    ((BITBANDING_PERIPHERAL_CAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPCAN_CAN0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPCAN_OFFSET) * 32UL) + (SYSCTL_PPCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPCAN_CAN1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPCAN_OFFSET) * 32UL) + (SYSCTL_PPCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************52 PPADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPADC    ((BITBANDING_PERIPHERAL_ADC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPADC_ADC0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPADC_OFFSET) * 32UL) + (SYSCTL_PPADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PPADC_ADC1    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPADC_OFFSET) * 32UL) + (SYSCTL_PPADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************53 PPACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPACMP    ((BITBANDING_PERIPHERAL_ACMP_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPACMP_OFFSET) * 32UL)))

