LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PPACMP_ACMP    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPACMP_OFFSET) * 32UL) + (SYSCTL_PPACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************54 PPPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPPWM    ((BITBANDING_PERIPHERAL_PWM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPPWM_PWM0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPPWM_OFFSET) * 32UL) + (SYSCTL_PPPWM_R_PWM0_BIT * 4UL))))

/******************************************************************************************
************************************55 PPQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPQEI    ((BITBANDING_PERIPHERAL_QEI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPQEI_QEI0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPQEI_OFFSET) * 32UL) + (SYSCTL_PPQEI_R_QEI0_BIT * 4UL))))

/******************************************************************************************
************************************56 PPLPC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPLPC    ((BITBANDING_PERIPHERAL_LPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPLPC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPLPC_LPC    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPLPC_OFFSET) * 32UL) + (SYSCTL_PPLPC_R_LPC_BIT * 4UL))))

/******************************************************************************************
************************************57 PPPECI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPPECI    ((BITBANDING_PERIPHERAL_PECI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPPECI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPPECI_PECI    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPPECI_OFFSET) * 32UL) + (SYSCTL_PPPECI_R_PECI_BIT * 4UL))))

/******************************************************************************************
************************************58 PPFAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPFAN    ((BITBANDING_PERIPHERAL_FAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPFAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPFAN_FAN    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPFAN_OFFSET) * 32UL) + (SYSCTL_PPFAN_R_FAN_BIT * 4UL))))

/******************************************************************************************
************************************59 PPEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPEEPROM    ((BITBANDING_PERIPHERAL_EEPROM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPEEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPEEPROM_EEPROM    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPEEPROM_OFFSET) * 32UL) + (SYSCTL_PPEEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************60 PPWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPWTIMER_WTIMER0    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPWTIMER_OFFSET) * 32UL) + (SYSCTL_PPWTIMER_R_WTIMER0_BIT * 4UL))))

/**********************************************************************************
************************************61 PPRTS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPRTS    ((BITBANDING_PERIPHERAL_RTS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPRTS_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPRTS_RTS    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPRTS_OFFSET) * 32UL) + (SYSCTL_PPRTS_R_RTS_BIT * 4UL))))

/**********************************************************************************
************************************62 PPCCM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPCCM    ((BITBANDING_PERIPHERAL_CCM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPCCM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPCCM_CCM    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPCCM_OFFSET) * 32UL) + (SYSCTL_PPCCM_R_CCM_BIT * 4UL))))

/**********************************************************************************
************************************63 PPLCD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPLCD    ((BITBANDING_PERIPHERAL_LCD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPLCD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPLCD_LCD    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPLCD_OFFSET) * 32UL) + (SYSCTL_PPLCD_R_LCD_BIT * 4UL))))

/**********************************************************************************
************************************64 PPOWIRE *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPOWIRE    ((BITBANDING_PERIPHERAL_OWIRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPOWIRE_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPOWIRE_OWIRE    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPOWIRE_OFFSET) * 32UL) + (SYSCTL_PPOWIRE_R_OWIRE_BIT * 4UL))))

/**********************************************************************************
************************************65 PPEMAC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPEMAC    ((BITBANDING_PERIPHERAL_EMAC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPEMAC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPEMAC_EMAC    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPEMAC_OFFSET) * 32UL) + (SYSCTL_PPEMAC_R_EMAC_BIT * 4UL))))

/**********************************************************************************
************************************66 PPPRB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPPRB    ((BITBANDING_PERIPHERAL_PRB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPPRB_OFFSET) * 32UL)))

