LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PPPRB_PRB    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPPRB_OFFSET) * 32UL) + (SYSCTL_PPPRB_R_PRB_BIT * 4UL))))

/**********************************************************************************
************************************67 PPHIM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PPHIM    ((BITBANDING_PERIPHERAL_HIM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPHIM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PPHIM_HIM    (*((volatile const UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PPHIM_OFFSET) * 32UL) + (SYSCTL_PPHIM_R_HIM_BIT * 4UL))))

/******************************************************************************************
************************************68 SRWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRWD    ((BITBANDING_PERIPHERAL_WD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRWD_WDT0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWD_OFFSET) * 32UL) + (SYSCTL_SRWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRWD_WDT1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWD_OFFSET) * 32UL) + (SYSCTL_SRWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************69 SRTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRTIMER    ((BITBANDING_PERIPHERAL_TIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRTIMER_TIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER5_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER6_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRTIMER_TIMER7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRTIMER_OFFSET) * 32UL) + (SYSCTL_SRTIMER_R_TIMER7_BIT * 4UL))))

/******************************************************************************************
************************************70 SRGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOA    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOB    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOC    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOD    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOE    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOF    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOG    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOH    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOJ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOK    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOL    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOM    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPION    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOP    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRGPIO_BITBANDING_GPIOQ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SRGPIO_OFFSET) * 32UL) + (SYSCTL_SRGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************71 SRDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRDMA    ((BITBANDING_PERIPHERAL_DMA_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRDMA_OFFSET) * 32UL)))

