LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_SRDMA_UDMA    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRDMA_OFFSET) * 32UL) + (SYSCTL_SRDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************72 SREPI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SREPI    ((BITBANDING_PERIPHERAL_EPI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SREPI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SREPI_EPI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SREPI_OFFSET) * 32UL) + (SYSCTL_SREPI_R_EPI0_BIT * 4UL))))

/******************************************************************************************
************************************73 SRHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRHIB    ((BITBANDING_PERIPHERAL_HIB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRHIB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRHIB_HIB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRHIB_OFFSET) * 32UL) + (SYSCTL_SRHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************74 SRUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRUART    ((BITBANDING_PERIPHERAL_UART_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRUART_UART0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRUART_UART7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUART_OFFSET) * 32UL) + (SYSCTL_SRUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************75 SRSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRSSI    ((BITBANDING_PERIPHERAL_SSI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRSSI_SSI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRSSI_OFFSET) * 32UL) + (SYSCTL_SRSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRSSI_SSI1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRSSI_OFFSET) * 32UL) + (SYSCTL_SRSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRSSI_SSI2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRSSI_OFFSET) * 32UL) + (SYSCTL_SRSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRSSI_SSI3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRSSI_OFFSET) * 32UL) + (SYSCTL_SRSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************76 SRI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRI2C    ((BITBANDING_PERIPHERAL_I2C_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRI2C_I2C0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C5_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C6_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C7_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C8    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C8_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRI2C_I2C9    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRI2C_OFFSET) * 32UL) + (SYSCTL_SRI2C_R_I2C9_BIT * 4UL))))

/******************************************************************************************
************************************77 SRUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRUSB    ((BITBANDING_PERIPHERAL_USB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRUSB_USB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRUSB_OFFSET) * 32UL) + (SYSCTL_SRUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************78 SREPHY *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SREPHY    ((BITBANDING_PERIPHERAL_EPHY_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SREPHY_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SREPHY_EPHY    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SREPHY_OFFSET) * 32UL) + (SYSCTL_SREPHY_R_EPHY_BIT * 4UL))))

/******************************************************************************************
************************************79 SRCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRCAN    ((BITBANDING_PERIPHERAL_CAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRCAN_CAN0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCAN_OFFSET) * 32UL) + (SYSCTL_SRCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRCAN_CAN1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCAN_OFFSET) * 32UL) + (SYSCTL_SRCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************80 SRADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRADC    ((BITBANDING_PERIPHERAL_ADC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRADC_ADC0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRADC_OFFSET) * 32UL) + (SYSCTL_SRADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SRADC_ADC1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRADC_OFFSET) * 32UL) + (SYSCTL_SRADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************81 SRACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRACMP    ((BITBANDING_PERIPHERAL_ACMP_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRACMP_ACMP    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRACMP_OFFSET) * 32UL) + (SYSCTL_SRACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************82 SRPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRPWM    ((BITBANDING_PERIPHERAL_PWM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRPWM_PWM0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRPWM_OFFSET) * 32UL) + (SYSCTL_SRPWM_R_PWM0_BIT * 4UL))))

/******************************************************************************************
************************************83 SRQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRQEI    ((BITBANDING_PERIPHERAL_QEI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRQEI_QEI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRQEI_OFFSET) * 32UL) + (SYSCTL_SRQEI_R_QEI0_BIT * 4UL))))

/******************************************************************************************
************************************84 SRLPC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRLPC    ((BITBANDING_PERIPHERAL_LPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRLPC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRLPC_LPC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRLPC_OFFSET) * 32UL) + (SYSCTL_SRLPC_R_LPC_BIT * 4UL))))

/******************************************************************************************
************************************85 SRPECI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRPECI    ((BITBANDING_PERIPHERAL_PECI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRPECI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRPECI_PECI    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRPECI_OFFSET) * 32UL) + (SYSCTL_SRPECI_R_PECI_BIT * 4UL))))

/******************************************************************************************
************************************86 SRFAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRFAN    ((BITBANDING_PERIPHERAL_FAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRFAN_OFFSET) * 32UL)))

