LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_SRFAN_FAN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRFAN_OFFSET) * 32UL) + (SYSCTL_SRFAN_R_FAN_BIT * 4UL))))

/******************************************************************************************
************************************87 SREEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SREEPROM    ((BITBANDING_PERIPHERAL_EEPROM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SREEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SREEPROM_EEPROM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SREEPROM_OFFSET) * 32UL) + (SYSCTL_SREEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************88 SRWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRWTIMER_WTIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRWTIMER_OFFSET) * 32UL) + (SYSCTL_SRWTIMER_R_WTIMER0_BIT * 4UL))))

/**********************************************************************************
************************************89 SRRTS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRRTS    ((BITBANDING_PERIPHERAL_RTS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRRTS_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRRTS_RTS    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRRTS_OFFSET) * 32UL) + (SYSCTL_SRRTS_R_RTS_BIT * 4UL))))

/**********************************************************************************
************************************90 SRCCM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRCCM    ((BITBANDING_PERIPHERAL_CCM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCCM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRCCM_CCM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRCCM_OFFSET) * 32UL) + (SYSCTL_SRCCM_R_CCM_BIT * 4UL))))

/**********************************************************************************
************************************91 SRLCD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRLCD    ((BITBANDING_PERIPHERAL_LCD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRLCD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRLCD_LCD    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRLCD_OFFSET) * 32UL) + (SYSCTL_SRLCD_R_LCD_BIT * 4UL))))

/**********************************************************************************
************************************92 SROWIRE *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SROWIRE    ((BITBANDING_PERIPHERAL_OWIRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SROWIRE_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SROWIRE_OWIRE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SROWIRE_OFFSET) * 32UL) + (SYSCTL_SROWIRE_R_OWIRE_BIT * 4UL))))

/**********************************************************************************
************************************93 SREMAC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SREMAC    ((BITBANDING_PERIPHERAL_EMAC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SREMAC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SREMAC_EMAC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SREMAC_OFFSET) * 32UL) + (SYSCTL_SREMAC_R_EMAC_BIT * 4UL))))

/**********************************************************************************
************************************94 SRPRB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRPRB    ((BITBANDING_PERIPHERAL_PRB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRPRB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRPRB_PRB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRPRB_OFFSET) * 32UL) + (SYSCTL_SRPRB_R_PRB_BIT * 4UL))))

/**********************************************************************************
************************************95 SRHIM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SRHIM    ((BITBANDING_PERIPHERAL_HIM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRHIM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SRHIM_HIM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SRHIM_OFFSET) * 32UL) + (SYSCTL_SRHIM_R_HIM_BIT * 4UL))))

/******************************************************************************************
************************************96 RCGCWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCWD    ((BITBANDING_PERIPHERAL_WD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCWD_WDT0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWD_OFFSET) * 32UL) + (SYSCTL_RCGCWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCWD_WDT1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWD_OFFSET) * 32UL) + (SYSCTL_RCGCWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************97 RCGCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCTIMER    ((BITBANDING_PERIPHERAL_TIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCTIMER_TIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER5_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER6_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCTIMER_TIMER7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCTIMER_R_TIMER7_BIT * 4UL))))

/******************************************************************************************
************************************98 RCGCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL)))

