LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOA    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOB    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOC    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOD    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOE    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOF    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOG    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOH    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOJ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOK    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOL    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOM    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPION    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOP    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCGPIO_BITBANDING_GPIOQ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_RCGCGPIO_OFFSET) * 32UL) + (SYSCTL_RCGCGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************99 RCGCDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCDMA    ((BITBANDING_PERIPHERAL_DMA_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCDMA_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCDMA_UDMA    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCDMA_OFFSET) * 32UL) + (SYSCTL_RCGCDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************100 RCGCEPI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCEPI    ((BITBANDING_PERIPHERAL_EPI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCEPI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCEPI_EPI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCEPI_OFFSET) * 32UL) + (SYSCTL_RCGCEPI_R_EPI0_BIT * 4UL))))

/******************************************************************************************
************************************101 RCGCHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCHIB    ((BITBANDING_PERIPHERAL_HIB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCHIB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCHIB_HIB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCHIB_OFFSET) * 32UL) + (SYSCTL_RCGCHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************102 RCGCUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCUART    ((BITBANDING_PERIPHERAL_UART_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCUART_UART0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCUART_UART7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUART_OFFSET) * 32UL) + (SYSCTL_RCGCUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************103 RCGCSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCSSI    ((BITBANDING_PERIPHERAL_SSI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCSSI_OFFSET) * 32UL)))

