LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_RCGCSSI_SSI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCSSI_OFFSET) * 32UL) + (SYSCTL_RCGCSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCSSI_SSI1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCSSI_OFFSET) * 32UL) + (SYSCTL_RCGCSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCSSI_SSI2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCSSI_OFFSET) * 32UL) + (SYSCTL_RCGCSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCSSI_SSI3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCSSI_OFFSET) * 32UL) + (SYSCTL_RCGCSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************104 RCGCI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCI2C    ((BITBANDING_PERIPHERAL_I2C_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCI2C_I2C0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C5_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C6_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C7_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C8    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C8_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCI2C_I2C9    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCI2C_OFFSET) * 32UL) + (SYSCTL_RCGCI2C_R_I2C9_BIT * 4UL))))

/******************************************************************************************
************************************105 RCGCUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCUSB    ((BITBANDING_PERIPHERAL_USB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCUSB_USB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCUSB_OFFSET) * 32UL) + (SYSCTL_RCGCUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************106 RCGCEPHY *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCEPHY    ((BITBANDING_PERIPHERAL_EPHY_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCEPHY_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCEPHY_EPHY    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCEPHY_OFFSET) * 32UL) + (SYSCTL_RCGCEPHY_R_EPHY_BIT * 4UL))))

/******************************************************************************************
************************************107 RCGCCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCCAN    ((BITBANDING_PERIPHERAL_CAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCCAN_CAN0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCCAN_OFFSET) * 32UL) + (SYSCTL_RCGCCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCCAN_CAN1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCCAN_OFFSET) * 32UL) + (SYSCTL_RCGCCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************108 RCGCADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCADC    ((BITBANDING_PERIPHERAL_ADC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCADC_ADC0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCADC_OFFSET) * 32UL) + (SYSCTL_RCGCADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_RCGCADC_ADC1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCADC_OFFSET) * 32UL) + (SYSCTL_RCGCADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************109 RCGCACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCACMP    ((BITBANDING_PERIPHERAL_ACMP_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCACMP_ACMP    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCACMP_OFFSET) * 32UL) + (SYSCTL_RCGCACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************110 RCGCPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCPWM    ((BITBANDING_PERIPHERAL_PWM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCPWM_PWM0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCPWM_OFFSET) * 32UL) + (SYSCTL_RCGCPWM_R_PWM0_BIT * 4UL))))

/******************************************************************************************
************************************111 RCGCQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCQEI    ((BITBANDING_PERIPHERAL_QEI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCQEI_QEI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCQEI_OFFSET) * 32UL) + (SYSCTL_RCGCQEI_R_QEI0_BIT * 4UL))))

/******************************************************************************************
************************************112 RCGCLPC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCLPC    ((BITBANDING_PERIPHERAL_LPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCLPC_OFFSET) * 32UL)))

