LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_RCGCLPC_LPC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCLPC_OFFSET) * 32UL) + (SYSCTL_RCGCLPC_R_LPC_BIT * 4UL))))

/******************************************************************************************
************************************113 RCGCPECI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCPECI    ((BITBANDING_PERIPHERAL_PECI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCPECI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCPECI_PECI    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCPECI_OFFSET) * 32UL) + (SYSCTL_RCGCPECI_R_PECI_BIT * 4UL))))

/******************************************************************************************
************************************114 RCGCFAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCFAN    ((BITBANDING_PERIPHERAL_FAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCFAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCFAN_FAN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCFAN_OFFSET) * 32UL) + (SYSCTL_RCGCFAN_R_FAN_BIT * 4UL))))

/******************************************************************************************
************************************115 RCGCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCEEPROM    ((BITBANDING_PERIPHERAL_EEPROM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCEEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCEEPROM_EEPROM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCEEPROM_OFFSET) * 32UL) + (SYSCTL_RCGCEEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************116 RCGCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCWTIMER_WTIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_RCGCWTIMER_R_WTIMER0_BIT * 4UL))))

/**********************************************************************************
************************************117 RCGCRTS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCRTS    ((BITBANDING_PERIPHERAL_RTS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCRTS_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCRTS_RTS    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCRTS_OFFSET) * 32UL) + (SYSCTL_RCGCRTS_R_RTS_BIT * 4UL))))

/**********************************************************************************
************************************118 RCGCCCM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCCCM    ((BITBANDING_PERIPHERAL_CCM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCCCM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCCCM_CCM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCCCM_OFFSET) * 32UL) + (SYSCTL_RCGCCCM_R_CCM_BIT * 4UL))))

/**********************************************************************************
************************************119 RCGCLCD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCLCD    ((BITBANDING_PERIPHERAL_LCD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCLCD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCLCD_LCD    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCLCD_OFFSET) * 32UL) + (SYSCTL_RCGCLCD_R_LCD_BIT * 4UL))))

/**********************************************************************************
************************************120 RCGCOWIRE *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCOWIRE    ((BITBANDING_PERIPHERAL_OWIRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCOWIRE_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCOWIRE_OWIRE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCOWIRE_OFFSET) * 32UL) + (SYSCTL_RCGCOWIRE_R_OWIRE_BIT * 4UL))))

/**********************************************************************************
************************************121 RCGCEMAC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCEMAC    ((BITBANDING_PERIPHERAL_EMAC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCEMAC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCEMAC_EMAC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCEMAC_OFFSET) * 32UL) + (SYSCTL_RCGCEMAC_R_EMAC_BIT * 4UL))))

/**********************************************************************************
************************************122 RCGCPRB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCPRB    ((BITBANDING_PERIPHERAL_PRB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCPRB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCPRB_PRB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCPRB_OFFSET) * 32UL) + (SYSCTL_RCGCPRB_R_PRB_BIT * 4UL))))

/**********************************************************************************
************************************123 RCGCHIM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RCGCHIM    ((BITBANDING_PERIPHERAL_HIM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCHIM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_RCGCHIM_HIM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RCGCHIM_OFFSET) * 32UL) + (SYSCTL_RCGCHIM_R_HIM_BIT * 4UL))))

/******************************************************************************************
************************************124 SCGCWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCWD    ((BITBANDING_PERIPHERAL_WD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCWD_WDT0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWD_OFFSET) * 32UL) + (SYSCTL_SCGCWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCWD_WDT1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWD_OFFSET) * 32UL) + (SYSCTL_SCGCWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************125 SCGCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCTIMER    ((BITBANDING_PERIPHERAL_TIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCTIMER_TIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER5_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER6_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCTIMER_TIMER7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCTIMER_R_TIMER7_BIT * 4UL))))

/******************************************************************************************
************************************126 SCGCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOA    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOB    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOC    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOD    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOE    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOF    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOG    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOH    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOJ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOK    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOL    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOM    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPION    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOP    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCGPIO_BITBANDING_GPIOQ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_SCGCGPIO_OFFSET) * 32UL) + (SYSCTL_SCGCGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************127 SCGCDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCDMA    ((BITBANDING_PERIPHERAL_DMA_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCDMA_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCDMA_UDMA    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCDMA_OFFSET) * 32UL) + (SYSCTL_SCGCDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************128 SCGCEPI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCEPI    ((BITBANDING_PERIPHERAL_EPI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCEPI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCEPI_EPI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCEPI_OFFSET) * 32UL) + (SYSCTL_SCGCEPI_R_EPI0_BIT * 4UL))))

/******************************************************************************************
************************************129 SCGCHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCHIB    ((BITBANDING_PERIPHERAL_HIB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCHIB_OFFSET) * 32UL)))

