LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_SCGCHIB_HIB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCHIB_OFFSET) * 32UL) + (SYSCTL_SCGCHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************130 SCGCUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCUART    ((BITBANDING_PERIPHERAL_UART_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCUART_UART0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCUART_UART7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUART_OFFSET) * 32UL) + (SYSCTL_SCGCUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************131 SCGCSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCSSI    ((BITBANDING_PERIPHERAL_SSI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCSSI_SSI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCSSI_OFFSET) * 32UL) + (SYSCTL_SCGCSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCSSI_SSI1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCSSI_OFFSET) * 32UL) + (SYSCTL_SCGCSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCSSI_SSI2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCSSI_OFFSET) * 32UL) + (SYSCTL_SCGCSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCSSI_SSI3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCSSI_OFFSET) * 32UL) + (SYSCTL_SCGCSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************132 SCGCI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCI2C    ((BITBANDING_PERIPHERAL_I2C_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCI2C_I2C0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C5_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C6_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C7_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C8    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C8_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCI2C_I2C9    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCI2C_OFFSET) * 32UL) + (SYSCTL_SCGCI2C_R_I2C9_BIT * 4UL))))

/******************************************************************************************
************************************133 SCGCUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCUSB    ((BITBANDING_PERIPHERAL_USB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCUSB_USB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCUSB_OFFSET) * 32UL) + (SYSCTL_SCGCUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************134 SCGCEPHY *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCEPHY    ((BITBANDING_PERIPHERAL_EPHY_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCEPHY_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCEPHY_EPHY    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCEPHY_OFFSET) * 32UL) + (SYSCTL_SCGCEPHY_R_EPHY_BIT * 4UL))))

/******************************************************************************************
************************************135 SCGCCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCCAN    ((BITBANDING_PERIPHERAL_CAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCCAN_CAN0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCCAN_OFFSET) * 32UL) + (SYSCTL_SCGCCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCCAN_CAN1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCCAN_OFFSET) * 32UL) + (SYSCTL_SCGCCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************136 SCGCADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCADC    ((BITBANDING_PERIPHERAL_ADC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCADC_ADC0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCADC_OFFSET) * 32UL) + (SYSCTL_SCGCADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_SCGCADC_ADC1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCADC_OFFSET) * 32UL) + (SYSCTL_SCGCADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************137 SCGCACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCACMP    ((BITBANDING_PERIPHERAL_ACMP_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCACMP_ACMP    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCACMP_OFFSET) * 32UL) + (SYSCTL_SCGCACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************138 SCGCPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCPWM    ((BITBANDING_PERIPHERAL_PWM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCPWM_PWM0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCPWM_OFFSET) * 32UL) + (SYSCTL_SCGCPWM_R_PWM0_BIT * 4UL))))

/******************************************************************************************
************************************139 SCGCQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCQEI    ((BITBANDING_PERIPHERAL_QEI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCQEI_QEI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCQEI_OFFSET) * 32UL) + (SYSCTL_SCGCQEI_R_QEI0_BIT * 4UL))))

/******************************************************************************************
************************************140 SCGCLPC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCLPC    ((BITBANDING_PERIPHERAL_LPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCLPC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCLPC_LPC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCLPC_OFFSET) * 32UL) + (SYSCTL_SCGCLPC_R_LPC_BIT * 4UL))))

/******************************************************************************************
************************************141 SCGCPECI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCPECI    ((BITBANDING_PERIPHERAL_PECI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCPECI_OFFSET) * 32UL)))

