LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_SCGCPECI_PECI    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCPECI_OFFSET) * 32UL) + (SYSCTL_SCGCPECI_R_PECI_BIT * 4UL))))

/******************************************************************************************
************************************142 SCGCFAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCFAN    ((BITBANDING_PERIPHERAL_FAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCFAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCFAN_FAN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCFAN_OFFSET) * 32UL) + (SYSCTL_SCGCFAN_R_FAN_BIT * 4UL))))

/******************************************************************************************
************************************143 SCGCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCEEPROM    ((BITBANDING_PERIPHERAL_EEPROM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCEEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCEEPROM_EEPROM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCEEPROM_OFFSET) * 32UL) + (SYSCTL_SCGCEEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************144 SCGCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCWTIMER_WTIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_SCGCWTIMER_R_WTIMER0_BIT * 4UL))))

/**********************************************************************************
************************************145 SCGCRTS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCRTS    ((BITBANDING_PERIPHERAL_RTS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCRTS_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCRTS_RTS    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCRTS_OFFSET) * 32UL) + (SYSCTL_SCGCRTS_R_RTS_BIT * 4UL))))

/**********************************************************************************
************************************146 SCGCCCM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCCCM    ((BITBANDING_PERIPHERAL_CCM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCCCM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCCCM_CCM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCCCM_OFFSET) * 32UL) + (SYSCTL_SCGCCCM_R_CCM_BIT * 4UL))))

/**********************************************************************************
************************************147 SCGCLCD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCLCD    ((BITBANDING_PERIPHERAL_LCD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCLCD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCLCD_LCD    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCLCD_OFFSET) * 32UL) + (SYSCTL_SCGCLCD_R_LCD_BIT * 4UL))))

/**********************************************************************************
************************************148 SCGCOWIRE *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCOWIRE    ((BITBANDING_PERIPHERAL_OWIRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCOWIRE_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCOWIRE_OWIRE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCOWIRE_OFFSET) * 32UL) + (SYSCTL_SCGCOWIRE_R_OWIRE_BIT * 4UL))))

/**********************************************************************************
************************************149 SCGCEMAC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCEMAC    ((BITBANDING_PERIPHERAL_EMAC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCEMAC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCEMAC_EMAC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCEMAC_OFFSET) * 32UL) + (SYSCTL_SCGCEMAC_R_EMAC_BIT * 4UL))))

/**********************************************************************************
************************************150 SCGCPRB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCPRB    ((BITBANDING_PERIPHERAL_PRB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCPRB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_SCGCPRB_PRB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCPRB_OFFSET) * 32UL) + (SYSCTL_SCGCPRB_R_PRB_BIT * 4UL))))

/**********************************************************************************
************************************151 SCGCHIM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_SCGCHIM    ((BITBANDING_PERIPHERAL_HIM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCHIM_OFFSET) * 32UL)))

