LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_SCGCHIM_HIM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_SCGCHIM_OFFSET) * 32UL) + (SYSCTL_SCGCHIM_R_HIM_BIT * 4UL))))

/******************************************************************************************
************************************152 DCGCWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCWD    ((BITBANDING_PERIPHERAL_WD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCWD_WDT0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWD_OFFSET) * 32UL) + (SYSCTL_DCGCWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCWD_WDT1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWD_OFFSET) * 32UL) + (SYSCTL_DCGCWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************153 DCGCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCTIMER    ((BITBANDING_PERIPHERAL_TIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCTIMER_TIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCTIMER_TIMER7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCTIMER_R_TIMER7_BIT * 4UL))))

/******************************************************************************************
************************************154 DCGCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOA    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOB    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOC    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOD    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOE    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOF    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOG    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOH    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOJ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOK    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOL    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOM    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPION    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOP    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCGPIO_BITBANDING_GPIOQ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_DCGCGPIO_OFFSET) * 32UL) + (SYSCTL_DCGCGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************155 DCGCDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCDMA    ((BITBANDING_PERIPHERAL_DMA_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCDMA_OFFSET) * 32UL)))

