LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_DCGCDMA_UDMA    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCDMA_OFFSET) * 32UL) + (SYSCTL_DCGCDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************156 DCGCEPI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCEPI    ((BITBANDING_PERIPHERAL_EPI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCEPI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCEPI_EPI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCEPI_OFFSET) * 32UL) + (SYSCTL_DCGCEPI_R_EPI0_BIT * 4UL))))

/******************************************************************************************
************************************157 DCGCHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCHIB    ((BITBANDING_PERIPHERAL_HIB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCHIB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCHIB_HIB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCHIB_OFFSET) * 32UL) + (SYSCTL_DCGCHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************158 DCGCUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCUART    ((BITBANDING_PERIPHERAL_UART_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCUART_UART0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCUART_UART7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUART_OFFSET) * 32UL) + (SYSCTL_DCGCUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************159 DCGCSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCSSI    ((BITBANDING_PERIPHERAL_SSI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCSSI_SSI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCSSI_OFFSET) * 32UL) + (SYSCTL_DCGCSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCSSI_SSI1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCSSI_OFFSET) * 32UL) + (SYSCTL_DCGCSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCSSI_SSI2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCSSI_OFFSET) * 32UL) + (SYSCTL_DCGCSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCSSI_SSI3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCSSI_OFFSET) * 32UL) + (SYSCTL_DCGCSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************160 DCGCI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCI2C    ((BITBANDING_PERIPHERAL_I2C_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCI2C_I2C0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C5_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C6_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C7_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C8    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C8_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCI2C_I2C9    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCI2C_OFFSET) * 32UL) + (SYSCTL_DCGCI2C_R_I2C9_BIT * 4UL))))

/******************************************************************************************
************************************161 DCGCUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCUSB    ((BITBANDING_PERIPHERAL_USB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCUSB_USB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCUSB_OFFSET) * 32UL) + (SYSCTL_DCGCUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************162 DCGCEPHY *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCEPHY    ((BITBANDING_PERIPHERAL_EPHY_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCEPHY_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCEPHY_EPHY    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCEPHY_OFFSET) * 32UL) + (SYSCTL_DCGCEPHY_R_EPHY_BIT * 4UL))))

/******************************************************************************************
************************************163 DCGCCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCCAN    ((BITBANDING_PERIPHERAL_CAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCCAN_OFFSET) * 32UL)))

