LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_DCGCCAN_CAN0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCCAN_OFFSET) * 32UL) + (SYSCTL_DCGCCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCCAN_CAN1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCCAN_OFFSET) * 32UL) + (SYSCTL_DCGCCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************164 DCGCADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCADC    ((BITBANDING_PERIPHERAL_ADC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCADC_ADC0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCADC_OFFSET) * 32UL) + (SYSCTL_DCGCADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_DCGCADC_ADC1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCADC_OFFSET) * 32UL) + (SYSCTL_DCGCADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************165 DCGCACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCACMP    ((BITBANDING_PERIPHERAL_ACMP_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCACMP_ACMP    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCACMP_OFFSET) * 32UL) + (SYSCTL_DCGCACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************166 DCGCPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCPWM    ((BITBANDING_PERIPHERAL_PWM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCPWM_PWM0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCPWM_OFFSET) * 32UL) + (SYSCTL_DCGCPWM_R_PWM0_BIT * 4UL))))

/******************************************************************************************
************************************167 DCGCQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCQEI    ((BITBANDING_PERIPHERAL_QEI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCQEI_QEI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCQEI_OFFSET) * 32UL) + (SYSCTL_DCGCQEI_R_QEI0_BIT * 4UL))))

/******************************************************************************************
************************************168 DCGCLPC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCLPC    ((BITBANDING_PERIPHERAL_LPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCLPC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCLPC_LPC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCLPC_OFFSET) * 32UL) + (SYSCTL_DCGCLPC_R_LPC_BIT * 4UL))))

/******************************************************************************************
************************************169 DCGCPECI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCPECI    ((BITBANDING_PERIPHERAL_PECI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCPECI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCPECI_PECI    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCPECI_OFFSET) * 32UL) + (SYSCTL_DCGCPECI_R_PECI_BIT * 4UL))))

/******************************************************************************************
************************************170 DCGCFAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCFAN    ((BITBANDING_PERIPHERAL_FAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCFAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCFAN_FAN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCFAN_OFFSET) * 32UL) + (SYSCTL_DCGCFAN_R_FAN_BIT * 4UL))))

/******************************************************************************************
************************************171 DCGCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCEEPROM    ((BITBANDING_PERIPHERAL_EEPROM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCEEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCEEPROM_EEPROM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCEEPROM_OFFSET) * 32UL) + (SYSCTL_DCGCEEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************172 DCGCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCWTIMER_WTIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCWTIMER_OFFSET) * 32UL) + (SYSCTL_DCGCWTIMER_R_WTIMER0_BIT * 4UL))))

/**********************************************************************************
************************************173 DCGCRTS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCRTS    ((BITBANDING_PERIPHERAL_RTS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCRTS_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCRTS_RTS    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCRTS_OFFSET) * 32UL) + (SYSCTL_DCGCRTS_R_RTS_BIT * 4UL))))

/**********************************************************************************
************************************174 DCGCCCM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCCCM    ((BITBANDING_PERIPHERAL_CCM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCCCM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCCCM_CCM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCCCM_OFFSET) * 32UL) + (SYSCTL_DCGCCCM_R_CCM_BIT * 4UL))))

/**********************************************************************************
************************************175 DCGCLCD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCLCD    ((BITBANDING_PERIPHERAL_LCD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCLCD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCLCD_LCD    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCLCD_OFFSET) * 32UL) + (SYSCTL_DCGCLCD_R_LCD_BIT * 4UL))))

/**********************************************************************************
************************************176 DCGCOWIRE *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCOWIRE    ((BITBANDING_PERIPHERAL_OWIRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCOWIRE_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCOWIRE_OWIRE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCOWIRE_OFFSET) * 32UL) + (SYSCTL_DCGCOWIRE_R_OWIRE_BIT * 4UL))))

/**********************************************************************************
************************************177 DCGCEMAC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCEMAC    ((BITBANDING_PERIPHERAL_EMAC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCEMAC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCEMAC_EMAC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCEMAC_OFFSET) * 32UL) + (SYSCTL_DCGCEMAC_R_EMAC_BIT * 4UL))))

/**********************************************************************************
************************************178 DCGCPRB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCPRB    ((BITBANDING_PERIPHERAL_PRB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCPRB_OFFSET) * 32UL)))

