LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_DCGCPRB_PRB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCPRB_OFFSET) * 32UL) + (SYSCTL_DCGCPRB_R_PRB_BIT * 4UL))))

/**********************************************************************************
************************************179 DCGCHIM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_DCGCHIM    ((BITBANDING_PERIPHERAL_HIM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCHIM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_DCGCHIM_HIM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_DCGCHIM_OFFSET) * 32UL) + (SYSCTL_DCGCHIM_R_HIM_BIT * 4UL))))

/******************************************************************************************
************************************180 PCWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCWD    ((BITBANDING_PERIPHERAL_WD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCWD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCWD_WDT0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCWD_OFFSET) * 32UL) + (SYSCTL_PCWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCWD_WDT1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCWD_OFFSET) * 32UL) + (SYSCTL_PCWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************181 PCTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCTIMER    ((BITBANDING_PERIPHERAL_TIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCTIMER_TIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCTIMER_OFFSET) * 32UL) + (SYSCTL_PCTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCTIMER_TIMER1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCTIMER_OFFSET) * 32UL) + (SYSCTL_PCTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCTIMER_TIMER2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCTIMER_OFFSET) * 32UL) + (SYSCTL_PCTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCTIMER_TIMER3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCTIMER_OFFSET) * 32UL) + (SYSCTL_PCTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCTIMER_TIMER4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCTIMER_OFFSET) * 32UL) + (SYSCTL_PCTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCTIMER_TIMER5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCTIMER_OFFSET) * 32UL) + (SYSCTL_PCTIMER_R_TIMER5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCTIMER_TIMER6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCTIMER_OFFSET) * 32UL) + (SYSCTL_PCTIMER_R_TIMER6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCTIMER_TIMER7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCTIMER_OFFSET) * 32UL) + (SYSCTL_PCTIMER_R_TIMER7_BIT * 4UL))))

/******************************************************************************************
************************************182 PCGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOA    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOB    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOC    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOD    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOE    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOF    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOG    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOH    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOJ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOK    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOL    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOM    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPION    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOP    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCGPIO_BITBANDING_GPIOQ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PCGPIO_OFFSET) * 32UL) + (SYSCTL_PCGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************183 PCDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCDMA    ((BITBANDING_PERIPHERAL_DMA_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCDMA_OFFSET) * 32UL)))

