LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PCDMA_UDMA    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCDMA_OFFSET) * 32UL) + (SYSCTL_PCDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************184 PCEPI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCEPI    ((BITBANDING_PERIPHERAL_EPI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCEPI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCEPI_EPI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCEPI_OFFSET) * 32UL) + (SYSCTL_PCEPI_R_EPI0_BIT * 4UL))))

/******************************************************************************************
************************************185 PCHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCHIB    ((BITBANDING_PERIPHERAL_HIB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCHIB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCHIB_HIB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCHIB_OFFSET) * 32UL) + (SYSCTL_PCHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************186 PCUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCUART    ((BITBANDING_PERIPHERAL_UART_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCUART_UART0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUART_OFFSET) * 32UL) + (SYSCTL_PCUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCUART_UART1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUART_OFFSET) * 32UL) + (SYSCTL_PCUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCUART_UART2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUART_OFFSET) * 32UL) + (SYSCTL_PCUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCUART_UART3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUART_OFFSET) * 32UL) + (SYSCTL_PCUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCUART_UART4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUART_OFFSET) * 32UL) + (SYSCTL_PCUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCUART_UART5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUART_OFFSET) * 32UL) + (SYSCTL_PCUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCUART_UART6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUART_OFFSET) * 32UL) + (SYSCTL_PCUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCUART_UART7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUART_OFFSET) * 32UL) + (SYSCTL_PCUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************187 PCSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCSSI    ((BITBANDING_PERIPHERAL_SSI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCSSI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCSSI_SSI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCSSI_OFFSET) * 32UL) + (SYSCTL_PCSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCSSI_SSI1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCSSI_OFFSET) * 32UL) + (SYSCTL_PCSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCSSI_SSI2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCSSI_OFFSET) * 32UL) + (SYSCTL_PCSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCSSI_SSI3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCSSI_OFFSET) * 32UL) + (SYSCTL_PCSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************188 PCI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCI2C    ((BITBANDING_PERIPHERAL_I2C_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCI2C_I2C0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL) + (SYSCTL_PCI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCI2C_I2C1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL) + (SYSCTL_PCI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCI2C_I2C2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL) + (SYSCTL_PCI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCI2C_I2C3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL) + (SYSCTL_PCI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCI2C_I2C4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL) + (SYSCTL_PCI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCI2C_I2C5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL) + (SYSCTL_PCI2C_R_I2C5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCI2C_I2C6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL) + (SYSCTL_PCI2C_R_I2C6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCI2C_I2C7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL) + (SYSCTL_PCI2C_R_I2C7_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCI2C_I2C8    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL) + (SYSCTL_PCI2C_R_I2C8_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCI2C_I2C9    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCI2C_OFFSET) * 32UL) + (SYSCTL_PCI2C_R_I2C9_BIT * 4UL))))

/******************************************************************************************
************************************189 PCUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCUSB    ((BITBANDING_PERIPHERAL_USB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCUSB_USB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCUSB_OFFSET) * 32UL) + (SYSCTL_PCUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************190 PCEPHY *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCEPHY    ((BITBANDING_PERIPHERAL_EPHY_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCEPHY_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCEPHY_EPHY    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCEPHY_OFFSET) * 32UL) + (SYSCTL_PCEPHY_R_EPHY_BIT * 4UL))))

/******************************************************************************************
************************************191 PCCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCCAN    ((BITBANDING_PERIPHERAL_CAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCCAN_CAN0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCCAN_OFFSET) * 32UL) + (SYSCTL_PCCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCCAN_CAN1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCCAN_OFFSET) * 32UL) + (SYSCTL_PCCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************192 PCADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCADC    ((BITBANDING_PERIPHERAL_ADC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCADC_ADC0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCADC_OFFSET) * 32UL) + (SYSCTL_PCADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PCADC_ADC1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCADC_OFFSET) * 32UL) + (SYSCTL_PCADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************193 PCACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCACMP    ((BITBANDING_PERIPHERAL_ACMP_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCACMP_ACMP    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCACMP_OFFSET) * 32UL) + (SYSCTL_PCACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************194 PCPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCPWM    ((BITBANDING_PERIPHERAL_PWM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCPWM_PWM0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCPWM_OFFSET) * 32UL) + (SYSCTL_PCPWM_R_PWM0_BIT * 4UL))))

/******************************************************************************************
************************************195 PCQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCQEI    ((BITBANDING_PERIPHERAL_QEI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCQEI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCQEI_QEI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCQEI_OFFSET) * 32UL) + (SYSCTL_PCQEI_R_QEI0_BIT * 4UL))))

/******************************************************************************************
************************************196 PCLPC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCLPC    ((BITBANDING_PERIPHERAL_LPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCLPC_OFFSET) * 32UL)))

