LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PCLPC_LPC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCLPC_OFFSET) * 32UL) + (SYSCTL_PCLPC_R_LPC_BIT * 4UL))))

/******************************************************************************************
************************************197 PCPECI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCPECI    ((BITBANDING_PERIPHERAL_PECI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCPECI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCPECI_PECI    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCPECI_OFFSET) * 32UL) + (SYSCTL_PCPECI_R_PECI_BIT * 4UL))))

/******************************************************************************************
************************************198 PCFAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCFAN    ((BITBANDING_PERIPHERAL_FAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCFAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCFAN_FAN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCFAN_OFFSET) * 32UL) + (SYSCTL_PCFAN_R_FAN_BIT * 4UL))))

/******************************************************************************************
************************************199 PCEEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCEEPROM    ((BITBANDING_PERIPHERAL_EEPROM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCEEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCEEPROM_EEPROM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCEEPROM_OFFSET) * 32UL) + (SYSCTL_PCEEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************200 PCWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCWTIMER_WTIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCWTIMER_OFFSET) * 32UL) + (SYSCTL_PCWTIMER_R_WTIMER0_BIT * 4UL))))

/**********************************************************************************
************************************201 PCRTS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCRTS    ((BITBANDING_PERIPHERAL_RTS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCRTS_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCRTS_RTS    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCRTS_OFFSET) * 32UL) + (SYSCTL_PCRTS_R_RTS_BIT * 4UL))))

/**********************************************************************************
************************************202 PCCCM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCCCM    ((BITBANDING_PERIPHERAL_CCM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCCCM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCCCM_CCM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCCCM_OFFSET) * 32UL) + (SYSCTL_PCCCM_R_CCM_BIT * 4UL))))

/**********************************************************************************
************************************203 PCLCD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCLCD    ((BITBANDING_PERIPHERAL_LCD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCLCD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCLCD_LCD    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCLCD_OFFSET) * 32UL) + (SYSCTL_PCLCD_R_LCD_BIT * 4UL))))

/**********************************************************************************
************************************204 PCOWIRE *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCOWIRE    ((BITBANDING_PERIPHERAL_OWIRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCOWIRE_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCOWIRE_OWIRE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCOWIRE_OFFSET) * 32UL) + (SYSCTL_PCOWIRE_R_OWIRE_BIT * 4UL))))

/**********************************************************************************
************************************205 PCEMAC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCEMAC    ((BITBANDING_PERIPHERAL_EMAC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCEMAC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCEMAC_EMAC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCEMAC_OFFSET) * 32UL) + (SYSCTL_PCEMAC_R_EMAC_BIT * 4UL))))

/**********************************************************************************
************************************206 PCPRB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCPRB    ((BITBANDING_PERIPHERAL_PRB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCPRB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCPRB_PRB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCPRB_OFFSET) * 32UL) + (SYSCTL_PCPRB_R_PRB_BIT * 4UL))))

/**********************************************************************************
************************************207 PCHIM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PCHIM    ((BITBANDING_PERIPHERAL_HIM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCHIM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PCHIM_HIM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PCHIM_OFFSET) * 32UL) + (SYSCTL_PCHIM_R_HIM_BIT * 4UL))))


/******************************************************************************************
************************************208 PRWD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRWD    ((BITBANDING_PERIPHERAL_WD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWD_OFFSET) * 32UL)))

