LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PRWD_WDT0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWD_OFFSET) * 32UL) + (SYSCTL_PRWD_R_WDT0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRWD_WDT1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWD_OFFSET) * 32UL) + (SYSCTL_PRWD_R_WDT1_BIT * 4UL))))

/******************************************************************************************
************************************209 PRTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRTIMER    ((BITBANDING_PERIPHERAL_TIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRTIMER_TIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRTIMER_TIMER7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRTIMER_OFFSET) * 32UL) + (SYSCTL_PRTIMER_R_TIMER7_BIT * 4UL))))

/******************************************************************************************
************************************210 PRGPIO *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRGPIO    ((BITBANDING_PERIPHERAL_GPIO_BITBANDING_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOA    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOA_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOB    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOB_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOC    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOC_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOD    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOD_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOE    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOE_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOF    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOF_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOG    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOG_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOH    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOH_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOJ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOJ_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOK    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOK_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOL    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOL_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOM    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOM_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPION    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPION_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOP    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOP_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRGPIO_BITBANDING_GPIOQ    (*((volatile UBase_t*) (SYSCTL_BASE  + (SYSCTL_OFFSET + SYSCTL_PRGPIO_OFFSET) * 32UL) + (SYSCTL_PRGPIO_R_GPIOQ_BIT * 4UL))))

/******************************************************************************************
************************************211 PRDMA *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRDMA    ((BITBANDING_PERIPHERAL_DMA_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRDMA_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRDMA_UDMA    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRDMA_OFFSET) * 32UL) + (SYSCTL_PRDMA_R_UDMA_BIT * 4UL))))

/******************************************************************************************
************************************212 PREPI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PREPI    ((BITBANDING_PERIPHERAL_EPI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PREPI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PREPI_EPI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PREPI_OFFSET) * 32UL) + (SYSCTL_PREPI_R_EPI0_BIT * 4UL))))

/******************************************************************************************
************************************213 PRHIB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRHIB    ((BITBANDING_PERIPHERAL_HIB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRHIB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRHIB_HIB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRHIB_OFFSET) * 32UL) + (SYSCTL_PRHIB_R_HIB_BIT * 4UL))))

/******************************************************************************************
************************************214 PRUART *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRUART    ((BITBANDING_PERIPHERAL_UART_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRUART_UART0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRUART_UART7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUART_OFFSET) * 32UL) + (SYSCTL_PRUART_R_UART7_BIT * 4UL))))

/******************************************************************************************
************************************215 PRSSI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRSSI    ((BITBANDING_PERIPHERAL_SSI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRSSI_OFFSET) * 32UL)))

