LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PRSSI_SSI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRSSI_OFFSET) * 32UL) + (SYSCTL_PRSSI_R_SSI0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRSSI_SSI1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRSSI_OFFSET) * 32UL) + (SYSCTL_PRSSI_R_SSI1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRSSI_SSI2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRSSI_OFFSET) * 32UL) + (SYSCTL_PRSSI_R_SSI2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRSSI_SSI3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRSSI_OFFSET) * 32UL) + (SYSCTL_PRSSI_R_SSI3_BIT * 4UL))))

/******************************************************************************************
************************************216 PRI2C *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRI2C    ((BITBANDING_PERIPHERAL_I2C_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRI2C_I2C0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C1_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C2    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C2_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C3    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C3_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C4    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C4_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C5    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C5_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C6    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C6_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C7    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C7_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C8    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C8_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRI2C_I2C9    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRI2C_OFFSET) * 32UL) + (SYSCTL_PRI2C_R_I2C9_BIT * 4UL))))

/******************************************************************************************
************************************217 PRUSB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRUSB    ((BITBANDING_PERIPHERAL_USB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUSB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRUSB_USB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRUSB_OFFSET) * 32UL) + (SYSCTL_PRUSB_R_USB_BIT * 4UL))))

/******************************************************************************************
************************************218 PREPHY *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PREPHY    ((BITBANDING_PERIPHERAL_EPHY_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PREPHY_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PREPHY_EPHY    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PREPHY_OFFSET) * 32UL) + (SYSCTL_PREPHY_R_EPHY_BIT * 4UL))))

/******************************************************************************************
************************************219 PRCAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRCAN    ((BITBANDING_PERIPHERAL_CAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRCAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRCAN_CAN0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRCAN_OFFSET) * 32UL) + (SYSCTL_PRCAN_R_CAN0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRCAN_CAN1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRCAN_OFFSET) * 32UL) + (SYSCTL_PRCAN_R_CAN1_BIT * 4UL))))

/******************************************************************************************
************************************220 PRADC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRADC    ((BITBANDING_PERIPHERAL_ADC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRADC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRADC_ADC0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRADC_OFFSET) * 32UL) + (SYSCTL_PRADC_R_ADC0_BIT * 4UL))))
#define SYSCTL_BITBANDING_PRADC_ADC1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRADC_OFFSET) * 32UL) + (SYSCTL_PRADC_R_ADC1_BIT * 4UL))))

/******************************************************************************************
************************************221 PRACMP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRACMP    ((BITBANDING_PERIPHERAL_ACMP_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRACMP_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRACMP_ACMP    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRACMP_OFFSET) * 32UL) + (SYSCTL_PRACMP_R_ACMP_BIT * 4UL))))

/****************************************************************************************
************************************222 PRPWM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRPWM    ((BITBANDING_PERIPHERAL_PWM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRPWM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRPWM_PWM0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRPWM_OFFSET) * 32UL) + (SYSCTL_PRPWM_R_PWM0_BIT * 4UL))))

/******************************************************************************************
************************************223 PRQEI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRQEI    ((BITBANDING_PERIPHERAL_QEI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRQEI_OFFSET) * 32UL)))

