LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define SYSCTL_BITBANDING_PRQEI_QEI0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRQEI_OFFSET) * 32UL) + (SYSCTL_PRQEI_R_QEI0_BIT * 4UL))))

/******************************************************************************************
************************************224 PRLPC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRLPC    ((BITBANDING_PERIPHERAL_LPC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRLPC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRLPC_LPC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRLPC_OFFSET) * 32UL) + (SYSCTL_PRLPC_R_LPC_BIT * 4UL))))

/******************************************************************************************
************************************225 PRPECI *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRPECI    ((BITBANDING_PERIPHERAL_PECI_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRPECI_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRPECI_PECI    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRPECI_OFFSET) * 32UL) + (SYSCTL_PRPECI_R_PECI_BIT * 4UL))))

/******************************************************************************************
************************************226 PRFAN *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRFAN    ((BITBANDING_PERIPHERAL_FAN_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRFAN_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRFAN_FAN    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRFAN_OFFSET) * 32UL) + (SYSCTL_PRFAN_R_FAN_BIT * 4UL))))

/******************************************************************************************
************************************227 PREEPROM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PREEPROM    ((BITBANDING_PERIPHERAL_EEPROM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PREEPROM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PREEPROM_EEPROM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PREEPROM_OFFSET) * 32UL) + (SYSCTL_PREEPROM_R_EEPROM_BIT * 4UL))))

/**********************************************************************************
************************************228 PRWTIMER *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRWTIMER    ((BITBANDING_PERIPHERAL_WTIMER_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWTIMER_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRWTIMER_WTIMER0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRWTIMER_OFFSET) * 32UL) + (SYSCTL_PRWTIMER_R_WTIMER0_BIT * 4UL))))

/**********************************************************************************
************************************229 PRRTS *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRRTS    ((BITBANDING_PERIPHERAL_RTS_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRRTS_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRRTS_RTS    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRRTS_OFFSET) * 32UL) + (SYSCTL_PRRTS_R_RTS_BIT * 4UL))))

/**********************************************************************************
************************************230 PRCCM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRCCM    ((BITBANDING_PERIPHERAL_CCM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRCCM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRCCM_CCM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRCCM_OFFSET) * 32UL) + (SYSCTL_PRCCM_R_CCM_BIT * 4UL))))

/**********************************************************************************
************************************231 PRLCD *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRLCD    ((BITBANDING_PERIPHERAL_LCD_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRLCD_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRLCD_LCD    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRLCD_OFFSET) * 32UL) + (SYSCTL_PRLCD_R_LCD_BIT * 4UL))))

/**********************************************************************************
************************************232 PROWIRE *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PROWIRE    ((BITBANDING_PERIPHERAL_OWIRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROWIRE_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PROWIRE_OWIRE    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PROWIRE_OFFSET) * 32UL) + (SYSCTL_PROWIRE_R_OWIRE_BIT * 4UL))))

/**********************************************************************************
************************************233 PREMAC *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PREMAC    ((BITBANDING_PERIPHERAL_EMAC_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PREMAC_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PREMAC_EMAC    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PREMAC_OFFSET) * 32UL) + (SYSCTL_PREMAC_R_EMAC_BIT * 4UL))))

/**********************************************************************************
************************************234 PRPRB *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRPRB    ((BITBANDING_PERIPHERAL_PRB_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRPRB_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRPRB_PRB    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRPRB_OFFSET) * 32UL) + (SYSCTL_PRPRB_R_PRB_BIT * 4UL))))

/**********************************************************************************
************************************235 PRHIM *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_PRHIM    ((BITBANDING_PERIPHERAL_HIM_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRHIM_OFFSET) * 32UL)))

#define SYSCTL_BITBANDING_PRHIM_HIM    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_PRHIM_OFFSET) * 32UL) + (SYSCTL_PRHIM_R_HIM_BIT * 4UL))))

/**********************************************************************************
************************************236 UNIQUEID0 *********************************************
******************************************************************************************/
#define UNIQUE_BITBANDING_ID0    ((UNIQUE_BITBANDING_ID_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + UNIQUE_ID0_OFFSET) * 32UL)))

/**********************************************************************************
************************************237 UNIQUEID1 *********************************************
******************************************************************************************/
#define UNIQUE_BITBANDING_ID1    ((UNIQUE_BITBANDING_ID_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + UNIQUE_ID1_OFFSET) * 32UL)))

/**********************************************************************************
************************************238 UNIQUEID2 *********************************************
******************************************************************************************/
#define UNIQUE_BITBANDING_ID2    ((UNIQUE_BITBANDING_ID_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + UNIQUE_ID2_OFFSET) * 32UL)))

/**********************************************************************************
************************************239 UNIQUEID3 *********************************************
******************************************************************************************/
#define UNIQUE_BITBANDING_ID3    ((UNIQUE_BITBANDING_ID_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + UNIQUE_ID3_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 240-Flash RVP *********************************************
******************************************************************************************/
#define SYSCTL_BITBANDING_RVP    ((SYSCTL_BITBANDING_RVP_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + SYSCTL_RVP_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 241-Flash FMPRE0 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE0    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE0_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 242-Flash FMPRE1 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE1    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE1_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 243-Flash FMPRE2 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE2    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE2_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 244-Flash FMPRE3 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE3    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE3_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 245-Flash FMPRE4 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE4    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE4_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 246-Flash FMPRE5 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE5    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE5_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 247-Flash FMPRE6 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE6    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE6_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 248-Flash FMPRE7 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE7    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE7_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 249-Flash FMPRE8 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE8    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE8_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 250-Flash FMPRE9 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE9    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE9_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 251-Flash FMPRE10 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE10    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE10_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 252-Flash FMPRE11 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE11    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE11_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 253-Flash FMPRE12 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE12    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE12_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 254-Flash FMPRE13 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE13    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE13_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 255-Flash FMPRE14 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE14    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE14_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 256-Flash FMPRE15 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PRE15    ((FLASH_BITBANDING_PRE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PRE15_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 257-Flash FMPPE0 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE0    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE0_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 258-Flash FMPPE1 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE1    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE1_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 259-Flash FMPPE2 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE2    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE2_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 260-Flash FMPPE3 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE3    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE3_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 261-Flash FMPPE4 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE4    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE4_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 262-Flash FMPPE5 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE5    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE5_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 263-Flash FMPPE6 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE6    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE6_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 264-Flash FMPPE7 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE7    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE7_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 265-Flash FMPPE8 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE8    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE8_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 266-Flash FMPPE9 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE9    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE9_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 267-Flash FMPPE10 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE10    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE10_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 268-Flash FMPPE11 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE11    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE11_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 269-Flash FMPPE12 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE12    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE12_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 270-Flash FMPPE13 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE13    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE13_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 271-Flash FMPPE14 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE14    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE14_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 272-Flash FMPPE15 *********************************************
******************************************************************************************/
#define FLASH_BITBANDING_PPE15    ((FLASH_BITBANDING_PPE_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + FLASH_PPE15_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 273-Flash BOOTCFG *********************************************
******************************************************************************************/
#define BOOT_BITBANDING_CFG    ((BOOT_BITBANDING_CFG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + BOOT_CFG_OFFSET) * 32UL)))

