LaloAlvarez-e/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterPeripheral_Bitbanding.h
#define BOOT_BITBANDING_CFG_DBG0    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + BOOT_CFG_OFFSET) * 32UL) + (BOOT_CFG_R_DBG0_BIT * 4UL))))
#define BOOT_BITBANDING_CFG_DBG1    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + BOOT_CFG_OFFSET) * 32UL) + (BOOT_CFG_R_DBG1_BIT * 4UL))))
#define BOOT_BITBANDING_CFG_KEY    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + BOOT_CFG_OFFSET) * 32UL) + (BOOT_CFG_R_KEY_BIT * 4UL))))
#define BOOT_BITBANDING_CFG_ENA    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + BOOT_CFG_OFFSET) * 32UL) + (BOOT_CFG_R_EN_BIT * 4UL))))
#define BOOT_BITBANDING_CFG_POL    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + BOOT_CFG_OFFSET) * 32UL) + (BOOT_CFG_R_POL_BIT * 4UL))))
#define BOOT_BITBANDING_CFG_NW    (*((volatile UBase_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + BOOT_CFG_OFFSET) * 32UL) + (BOOT_CFG_R_NW_BIT * 4UL))))

/******************************************************************************************
************************************ 274-Flash USER_REG0 *********************************************
******************************************************************************************/
#define USER_BITBANDING_REG0    ((USER_BITBANDING_REG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USER_REG0_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 275-Flash USER_REG1 *********************************************
******************************************************************************************/
#define USER_BITBANDING_REG1    ((USER_BITBANDING_REG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USER_REG1_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 276-Flash USER_REG2 *********************************************
******************************************************************************************/
#define USER_BITBANDING_REG2    ((USER_BITBANDING_REG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USER_REG2_OFFSET) * 32UL)))

/******************************************************************************************
************************************ 277-Flash USER_REG3 *********************************************
******************************************************************************************/
#define USER_BITBANDING_REG3    ((USER_BITBANDING_REG_t*) (SYSCTL_BITBANDING_BASE + ((SYSCTL_OFFSET + USER_REG3_OFFSET) * 32UL)))

#endif /* XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERPERIPHERAL_BITBANDING_H_ */
